#1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [1]:
import pandas as pd
ds = pd.Series([2, 4, 6, 8, 10])
print(ds)

0     2
1     4
2     6
3     8
4    10
dtype: int64

#2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [2]:
import pandas as pd
ds = pd.Series([2, 4, 6, 8, 10])
print("Pandas Series and type")
print(ds)
print(type(ds))
print("Convert Pandas Series to Python list")
print(ds.tolist())
print(type(ds.tolist()))

Pandas Series and type
0     2
1     4
2     6
3     8
4    10
dtype: int64
<class 'pandas.core.series.Series'>
Convert Pandas Series to Python list
[2, 4, 6, 8, 10]
<class 'list'>

#3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
   Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

#4. Write a Pandas program to convert a dictionary to a Pandas series.

In [4]:
import pandas as pd
d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print("Original dictionary:")
print(d1)
new_series = pd.Series(d1)
print("Converted series:")
print(new_series)

Original dictionary:
{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Converted series:
a    100
b    200
c    300
d    400
e    800
dtype: int64

#5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [ ]:
import numpy as np
import pandas as pd
np_array = np.array([10, 20, 30, 40, 50])
print("NumPy array:")
print(np_array)
new_series = pd.Series(np_array)
print("Converted Pandas series:")
print(new_series)

#6. Write a Pandas program to change the data type of given a column or a Series.

In [7]:
import pandas as pd
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Change the said data type to numeric:")
s2 = pd.to_numeric(s1, errors='coerce')
print(s2)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

#7. Write a Pandas program to convert a given Series to an array.

In [8]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Series to an array")
a = s1.values
print(a)
print(type(a))

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']
<class 'numpy.ndarray'>

#8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [14]:
details = {
    'Name' : ['Ghanshyam', 'Sameer', 'Sangam', 'Ankit'],
    'Age' : [22, 22, 23, 22],
    'University' : ['NMU', 'NMU', 'NMU', 'NMU'],
}

df = pd.DataFrame(details)
print(df)

        Name  Age University
0  Ghanshyam   22        NMU
1     Sameer   22        NMU
2     Sangam   23        NMU
3      Ankit   22        NMU

#9. i) Create a list of empids and names (10 employees).
   ii) Convert list into Series.
   iii) Print type of Series.
   iv) Convert Series into DataFrame.
   v) a) Display all records.
      b) Display first five records.
      c) Display last five records.
      d) Display first two and last two records.
      e) Display name of 5th employee.
      f) Display record of 4th employee.
   vi) Save the record in csv file (MyRecord.csv)

In [23]:
import pandas as pd
empid = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
name = pd.Series(['Ghanshyam', 'Sameer', 'Sangam', 'Ankit', 'Muskan', 'Snehal', 'Shital', 'Nikita', 'Gayatri', 'Bhagyashree'],index = empid)
print(name)

1       Ghanshyam
2          Sameer
3          Sangam
4           Ankit
5          Muskan
6          Snehal
7          Shital
8          Nikita
9         Gayatri
10    Bhagyashree
dtype: object

In [25]:
df = pd.DataFrame(name)
print(df)

              0
1     Ghanshyam
2        Sameer
3        Sangam
4         Ankit
5        Muskan
6        Snehal
7        Shital
8        Nikita
9       Gayatri
10  Bhagyashree

In [27]:
df.describe

<bound method NDFrame.describe of               0
1     Ghanshyam
2        Sameer
3        Sangam
4         Ankit
5        Muskan
6        Snehal
7        Shital
8        Nikita
9       Gayatri
10  Bhagyashree>

In [28]:
df.head()

           0
1  Ghanshyam
2     Sameer
3     Sangam
4      Ankit
5     Muskan

In [29]:
df.tail()

              0
6        Snehal
7        Shital
8        Nikita
9       Gayatri
10  Bhagyashree

In [30]:
df.head(2)

           0
1  Ghanshyam
2     Sameer

In [31]:
df.tail(2)

              0
9       Gayatri
10  Bhagyashree

In [33]:
df.iloc[4]

0    Muskan
Name: 5, dtype: object

In [34]:
df.iloc[3]

0    Ankit
Name: 4, dtype: object

In [36]:
df.to_csv('MyRecord.csv')

#10. i) Read the MyRecord.csv file.
    ii) Create a new column Salary.

In [2]:
import pandas as pd
df = pd.read_csv('./MyRecord.csv')

In [6]:
df.describe

<bound method NDFrame.describe of    Unnamed: 0            0
0           1    Ghanshyam
1           2       Sameer
2           3       Sangam
3           4        Ankit
4           5       Muskan
5           6       Snehal
6           7       Shital
7           8       Nikita
8           9      Gayatri
9          10  Bhagyashree>

In [15]:
salary = [1000,2000,3000,4000,5000,6000,7000,8000,9000,1100]
df['Salary'] = salary
print(salary)
df.to_csv('./MyRecord.csv')

[1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 1100]

#12. Refer the dataset "Salaries.csv" and perform following tasks.
i) Read the dataset in dataframe.

ii) display first five records.

iii) display first ten records.

iv) display last five records.

v) display last ten records.

vi) display the columns inside the dataset.

vii) display shape of data.

viii) describe the dataset.

ix) display the information about the dataset and analyse the data.

x) display types of each columns.

xi) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [17]:
df = pd.read_csv('./Salary_Data.csv')

In [18]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [19]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [20]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [21]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [22]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [25]:
df.shape

(33, 2)

In [27]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [29]:
df.info

<bound method DataFrame.info of     YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000>

In [32]:
print(df.dtypes)

YearsExperience    float64
Salary               int64
dtype: object

In [36]:
df.max()

YearsExperience        13.0
Salary             156000.0
dtype: float64

In [35]:
df.min()

YearsExperience        1.1
Salary             37731.0
dtype: float64

In [37]:
df.mean()

YearsExperience        5.921212
Salary             82760.303030
dtype: float64

In [38]:
df.median()

YearsExperience        5.1
Salary             67938.0
dtype: float64

In [43]:
df.std()

YearsExperience        3.342413
Salary             34014.620992
dtype: float64